УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_РабочийСтол/КонтурЗакупки_РабочийСтол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_РабочийСтол</name>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/КонтурЗакупки_УведомленияЛентаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_УведомленияЛентаПользователя</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_РабочийСтол/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КонтурУведомленияПрочитаноНеПрочитано" Тогда
		УправлениеВидимостьюДоступностьюВиджетаУведомлений();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	КонтурЗакупки_РаботаСЗакупкамиСервер.ЗаполнениеСправочникаОтраслей();
	КонтурЗакупки_РаботаСЗакупкамиСервер.ЗаполнениеСправочникаОтраслейОбновленных();
	КонтурЗакупки_РаботаСЗакупкамиСервер.ЗаполнитьОрганизатораВЗакупках();
	КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ЗаполнитьОрганизатораВОбработкахЗакупки();

	КлючРасширения = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьКлючРасширения();
	Если КонтурЗакупки_СлужебныеВызовСервера.ПодсистемаЭтоРасширение(КлючРасширения) Тогда

		ВерсияРасширения = КонтурЗакупки_ОбновлениеВызовСервера.ПолучитьТекущуюВерсиюРасширения(КлючРасширения);
		Если ВерсияРасширения.БезопасныйРежим Или ВерсияРасширения.ЗащитаОтОпасныхДействий Тогда
			Отказ = Истина;

			КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(
		СтрШаблон(НСтр("ru = 'Для расширения %1 необходимо отключить безопасный режим и защиту от опасных действий'"),
				КлючРасширения));
		КонецЕсли;
		КонтурЗакупки_ОбновлениеВызовСервера.ЗаписатьХешСуммуРасширения(КлючРасширения);
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюДоступностьюВиджетаУведомлений();
	ОбработчикОжиданияОткрытьФормуУведомленийПриЗапуске();
	ОбновлениеСчетчиковНаСервере();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСчетчики(Команда)
	ОбновлениеСчетчиковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_ОтчетПоСтатусамЗакупок(Команда)
	ОткрытьФорму("Отчет.КонтурЗакупки_ОтчетПоСтатусамЗакупок.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУведомлений(Команда)
	НазваниеПроекта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьНазваниеПродукта();
	ВерсияМодуля = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьВерсиюПродукта();
	ИДКлиента = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьClientID();
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("НазваниеПроекта", НазваниеПроекта);
	СтруктураПараметры.Вставить("ВерсияПроекта", ВерсияМодуля);
	СтруктураПараметры.Вставить("ИДКлиента", ИДКлиента);
	ОткрытьФорму("РегистрСведений.КонтурЗакупки_УведомленияЛентаПользователя.ФормаСписка", СтруктураПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_РегламентнаяЗагрузкаЗакупок(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_РегламентнаяЗагрузкаЗакупок.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_ИнформацияОЛимитах(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_ИнформацияОЛимитах.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_СтатусыЗакупки(Команда)
	ОткрытьФорму("Справочник.КонтурЗакупки_СтатусыЗакупки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_ДанныеЗакупки(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_ДанныеЗакупки.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_Метки(Команда)
	ОткрытьФорму("Справочник.КонтурЗакупки_Метки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_Отрасли(Команда)
	ОткрытьФорму("Справочник.КонтурЗакупки_Отрасли.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоиска(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_ПоискЗакупок.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПолучениеИзбранныхЗакупок(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_ПолучениеИзбранныхЗакупок.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокументовЗакупки(Команда)
	ОткрытьФорму("Документ.КонтурЗакупки_Закупка.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_Настройки(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_Настройки.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПолучениеМетокИзбранныхЗакупок(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_ПолучениеМетокИзбранного.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуШаблоныПоискаЗакупок(Команда)
	ОткрытьФорму("Справочник.КонтурЗакупки_ШаблоныПоиска.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуШаблоныЗагрузокИзбранного(Команда)
	ОткрытьФорму("Справочник.КонтурЗакупки_ШаблоныЗагрузкиИзбранного.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбновление(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_Обновление.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_ОтраслиОбновленные(Команда)
	ОткрытьФорму("Справочник.КонтурЗакупки_ОтраслиОбновленные.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_ПодключаемыйМодуль(Команда)
	ОткрытьФорму("Обработка.КонтурЗакупки_ПодключаемыйМодуль.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокументыОбработкаЗакупок(Команда)
	ОткрытьФорму("Документ.КонтурЗакупки_ОбработкаЗакупки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтурЗакупки_ОтчетПоРезультатамЗакупок(Команда)
	
	ОткрытьФорму("Отчет.КонтурЗакупки_ОтчетПоРезультатамЗакупок.Форма", , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновлениеСчетчиковНаСервере()
	// структура
	// ключ - название счетчика и реквизита формы
	// значение - представление счетчика
	СтруктураСчетчиков = Новый Структура;
	СтруктураСчетчиков.Вставить("СчетчикЗадачОбработкаЗакупок", "-");

	Обработки.КонтурЗакупки_РабочийСтол.ОбновитьСчетчики(СтруктураСчетчиков, ПараметрыСеанса.ТекущийПользователь,
		КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьРольПользователя());
	Если ТипЗнч(СтруктураСчетчиков) = Тип("Структура") Тогда
		Для Каждого Счетчик Из СтруктураСчетчиков Цикл
			Если Не Элементы.Найти(Счетчик.Ключ) = Неопределено Тогда
				ЭтотОбъект[Счетчик.Ключ] = Счетчик.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУведомленийПриНеобходимости(ПервыйЗапуск, ИнформацияПоУведомлениям)

	Если ПервыйЗапуск И ИнформацияПоУведомлениям.ЕстьНепрочитанные Или ЗначениеЗаполнено(
			ИнформацияПоУведомлениям.ИдентификаторВажногоНепрочитанного) Тогда
		НазваниеПроекта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьНазваниеПродукта();
		ВерсияМодуля = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьВерсиюПродукта();
		ИДКлиента = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьClientID();

		ПараметрыФормыУведомлений = Новый Структура;
		ПараметрыФормыУведомлений.Вставить("ОтборПрочитано", 1);
		ПараметрыФормыУведомлений.Вставить("НазваниеПроекта", НазваниеПроекта);
		ПараметрыФормыУведомлений.Вставить("ВерсияПроекта", ВерсияМодуля);
		ПараметрыФормыУведомлений.Вставить("ИДКлиента", ИДКлиента);
		Если ЗначениеЗаполнено(ИнформацияПоУведомлениям.ИдентификаторВажногоНепрочитанного) Тогда
			ПараметрыФормыУведомлений.Вставить("ИдентификаторПозиционирования",
				ИнформацияПоУведомлениям.ИдентификаторВажногоНепрочитанного);
		КонецЕсли;

		ОткрытьФорму("РегистрСведений.КонтурЗакупки_УведомленияЛентаПользователя.ФормаСписка",
			ПараметрыФормыУведомлений, , , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияОткрытьФормуУведомленийПриЗапуске()
	ИнформацияПоУведомлениям = ИнформацияПоУведомлениям(Истина);
	ОткрытьФормуУведомленийПриНеобходимости(Истина, ИнформацияПоУведомлениям);

	ПодключитьОбработчикОжидания("ОбработчикОжиданияОткрытьФормуУведомленийПриПоявленииВажного", 600, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияОткрытьФормуУведомленийПриПоявленииВажного()

	ИнформацияПоУведомлениям = ИнформацияПоУведомлениям(Истина);
	ОткрытьФормуУведомленийПриНеобходимости(Ложь, ИнформацияПоУведомлениям);

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностьюВиджетаУведомлений()

	ИнформацияПоУведомлениям = ИнформацияПоУведомлениям(Ложь);

	Если ИнформацияПоУведомлениям.ЕстьНепрочитанные Тогда

		Элементы.ОткрытьФормуУведомлений.Картинка = БиблиотекаКартинок.КонтурЗакупки_УведомленияВнимание;
		Элементы.ОткрытьФормуУведомлений.Заголовок = "У вас есть непрочитанные уведомления";
		Элементы.ОткрытьФормуУведомлений.ЦветТекста = WebЦвета.Красный;

	Иначе

		Элементы.ОткрытьФормуУведомлений.Картинка = БиблиотекаКартинок.КонтурЗакупки_УведомленияОбычный;
		Элементы.ОткрытьФормуУведомлений.Заголовок = "Уведомления";
		Элементы.ОткрытьФормуУведомлений.ЦветТекста = Новый Цвет(51, 51, 51);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияПоУведомлениям(УчитыватьИнтервалОтложенных)
	НазваниеПроекта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьНазваниеПродукта();
	ВерсияПроекта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьВерсиюПродукта();
	ИДКлиента = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьClientID();

	Инфо = РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.ИнформацияПоУведомлениям(
		НазваниеПроекта, ВерсияПроекта, ИДКлиента, УчитыватьИнтервалОтложенных);
	Возврат Инфо;

КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	ЭтоАдминистратор = РольДоступна("КонтурЗакупки_Администратор") Или РольДоступна("АдминистраторСистемы");
	
	Элементы.ВсеФункцииПодменюНастройки.Видимость = ЭтоАдминистратор;
	Элементы.ПодменюНастройки.Видимость = ЭтоАдминистратор;
	
КонецПроцедуры

#КонецОбласти
